cfe/src/InformationRegisters/ИИ_ИсторияЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИИ_ИсторияЧатов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИИ_РолиСообщений</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСообщения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сессия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИИ_СессииЧатов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>32</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cfe/src/Enums/ИИ_РолиСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ИИ_РолиСообщений</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Пользователь</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ассистент</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cfe/src/Catalogs/ИИ_СессииЧатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>ИИ_СессииЧатов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтекстОбъектаJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		<Attribute>
			<Properties>
				<Name>ОбъектКонтекста</Name>
				<Comment>Объект, к которому привязана контекстная сессия чата.</Comment>
				<Type>
					<v8:Type>cfg:DefinedType.ИИ_ТипыОбъектовКонтекстныхЗапросов</v8:Type>
				</Type>
			</Properties>
		</Attribute>

			<Attribute>
				<Properties>
					<Name>Контекстный</Name>
					<Comment>Признак того, что сессия привязана к контексту объекта.</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfe/src/CommonModules/ИИ_АссистентСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Создает новую сессию чата.
//
// Параметры:
//  ТекстПервогоСообщения - Строка - текст первого сообщения пользователя.
//  КонтекстОбъектаJSON - Строка - JSON с контекстом объекта (опционально).
//  ОбъектКонтекста - ОпределяемыйТип.ИИ_ТипыОбъектовКонтекстныхЗапросов - объект контекста (опционально).
//
// Возвращаемое значение:
//  СправочникСсылка.ИИ_СессииЧатов - ссылка на созданную сессию.
//
Функция СоздатьСессию(
 		Знач ТекстПервогоСообщения = "",
 		Знач КонтекстОбъектаJSON = "",
 		Знач ОбъектКонтекста = Неопределено) Экспорт
 	
 	НоваяСессия = Справочники.ИИ_СессииЧатов.СоздатьЭлемент();
  	НоваяСессия.Наименование = "Новый чат";
  	НоваяСессия.Пользователь = ИмяПользователя();
  	НоваяСессия.КонтекстОбъектаJSON = КонтекстОбъектаJSON;
  	НоваяСессия.ОбъектКонтекста = ОбъектКонтекста;
  	НоваяСессия.Контекстный = ЗначениеЗаполнено(ОбъектКонтекста)
  		Или ЗначениеЗаполнено(КонтекстОбъектаJSON);
  	НоваяСессия.Записать();
 	
 	Возврат НоваяСессия.Ссылка;
 	
 КонецФункции

// Формирует JSON-описание объекта для передачи в шлюз как контекст.
//
// Параметры:
//  ОбъектСсылка - ЛюбаяСсылка - ссылка на объект, для которого нужно получить контекст.
//
// Возвращаемое значение:
//  Строка - JSON-строка с полями type, name, synonym, presentation, ref, guid, attributes.
//
Функция ПолучитьКонтекстОбъекта(Знач ОбъектСсылка) Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("type", Строка(ТипЗнч(ОбъектСсылка)));
	Результат.Вставить("name", ОбъектСсылка.Метаданные().Имя);
	Результат.Вставить("synonym", Строка(ОбъектСсылка.Метаданные().ПредставлениеОбъекта));
	Результат.Вставить("presentation", Строка(ОбъектСсылка));
	Результат.Вставить("ref", Строка(ОбъектСсылка));
	Результат.Вставить("guid", Строка(ОбъектСсылка.УникальныйИдентификатор()));
	
	Атрибуты = Новый Массив;
	Для Каждого Реквизит Из ОбъектСсылка.Метаданные().Реквизиты Цикл
		Попытка
			ЗначениеРеквизита = ОбъектСсылка[Реквизит.Имя];
			ОписаниеРеквизита = Новый Структура;
			ОписаниеРеквизита.Вставить("name", Реквизит.Имя);
			ОписаниеРеквизита.Вставить("synonym", Строка(Реквизит.Представление()));
			ОписаниеРеквизита.Вставить("value", Строка(ЗначениеРеквизита));
			Атрибуты.Добавить(ОписаниеРеквизита);
		Исключение
			// Реквизит недоступен по ссылке - пропускаем.
			ЗаписьЖурналаРегистрации("ИИ_Ассистент.ПолучитьКонтекстОбъекта", УровеньЖурналаРегистрации.Предупреждение, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		КонецПопытки;
	КонецЦикла;
	Результат.Вставить("attributes", Атрибуты);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Результат);
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Запускает фоновое задание для выполнения запроса к шлюзу ИИ-ассистента.
// Результат фонового задания помещается во временное хранилище по адресу,
// который возвращается вместе с идентификатором задания.
//
// Параметры:
//  АдресШлюза - Строка - адрес шлюза в формате "host:port".
//  Таймаут - Число - таймаут соединения в секундах.
//  Модель - Строка - имя модели.
//  ТекстВопроса - Строка - текст вопроса пользователя.
//  История - Массив - история сообщений.
//  КонтекстОбъектаJSON - Строка - JSON с контекстом объекта.
//  ПромптПодсказка - Строка - дополнительная подсказка.
//  Вложения - Массив - вложения.
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия, для которой выполняется запрос (для оповещения).
//
// Возвращаемое значение:
//  Структура - данные запущенного задания:
//   * ИдентификаторЗадания - Строка - UUID фонового задания.
//   * АдресХранилища - Строка - адрес временного хранилища для получения результата.
//
Функция ЗапуститьЗапросКШлюзу(
		Знач АдресШлюза,
		Знач Таймаут,
		Знач ТекстВопроса,
		Знач История,
		Знач КонтекстОбъектаJSON = "",
		Знач ПромптПодсказка = "",
		Знач Вложения = Неопределено,
		Знач Сессия = Неопределено) Экспорт
	
	// Создаем временное хранилище в сеансе, инициировавшем фоновое задание.
	// Фоновое задание запишет результат по этому адресу.
	АдресХранилища = ПоместитьВоВременноеХранилище(Неопределено);
	
	Параметры = Новый Массив;
	Параметры.Добавить(АдресШлюза);
	Параметры.Добавить(Таймаут);
	Параметры.Добавить(ТекстВопроса);
	Параметры.Добавить(История);
	Параметры.Добавить(КонтекстОбъектаJSON);
	Параметры.Добавить(ПромптПодсказка);
	Параметры.Добавить(Вложения);
	Параметры.Добавить(АдресХранилища);
	Параметры.Добавить(Сессия);
	
	ФоновоеЗадание = ФоновыеЗадания.Выполнить("ИИ_АссистентСервер.ВыполнитьЗапросКШлюзу", Параметры);
	
	Результат = Новый Структура;
	Результат.Вставить("ИдентификаторЗадания", Строка(ФоновоеЗадание.УникальныйИдентификатор));
	Результат.Вставить("АдресХранилища", АдресХранилища);
	
	Возврат Результат;
	
КонецФункции

// Проверяет состояние фонового задания и возвращает его результат из временного хранилища.
//
// Параметры:
//  ИдентификаторЗадания - Строка - UUID фонового задания.
//  АдресХранилища - Строка - адрес временного хранилища, куда фоновое задание поместит результат.
//
// Возвращаемое значение:
//  Структура - результат проверки:
//   * Статус - Строка - "Выполняется", "Завершено", "Ошибка", "НеНайдено".
//   * Успешно - Булево - признак успешного выполнения (актуально при Статус = "Завершено").
//   * Ответ - Строка - текст ответа шлюза.
//   * СообщениеОбОшибке - Строка - описание ошибки.
//
Функция ПроверитьФоновоеЗадание(Знач ИдентификаторЗадания, Знач АдресХранилища) Экспорт
	
	Результат = Новый Структура("Статус, Успешно, Ответ, СообщениеОбОшибке", "НеНайдено", Ложь, "", "");
	
	Попытка
		UUID = Новый УникальныйИдентификатор(ИдентификаторЗадания);
	Исключение
		Результат.Статус = "Ошибка";
		Результат.СообщениеОбОшибке = "Некорректный идентификатор фонового задания.";
		Возврат Результат;
	КонецПопытки;
	
	ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(UUID);
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	Если ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		Результат.Статус = "Выполняется";
	ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.ЗавершеноАварийно Тогда
		Результат.Статус = "Ошибка";
		Результат.СообщениеОбОшибке = "Фоновое задание завершилось с ошибкой.";
		Если ФоновоеЗадание.ИнформацияОбОшибке <> Неопределено Тогда
			Результат.СообщениеОбОшибке = Результат.СообщениеОбОшибке + " " + ФоновоеЗадание.ИнформацияОбОшибке.Описание;
		КонецЕсли;
	ИначеЕсли ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Отменено Тогда
		Результат.Статус = "Ошибка";
		Результат.СообщениеОбОшибке = "Фоновое задание отменено.";
	Иначе
		Результат.Статус = "Завершено";
		РезультатРаботы = ПолучитьИзВременногоХранилища(АдресХранилища);
		Если ТипЗнч(РезультатРаботы) = Тип("Структура") Тогда
			РезультатРаботы.Свойство("Успешно", Результат.Успешно);
			РезультатРаботы.Свойство("Ответ", Результат.Ответ);
			РезультатРаботы.Свойство("СообщениеОбОшибке", Результат.СообщениеОбОшибке);
		Иначе
			Результат.СообщениеОбОшибке = "Фоновое задание не вернуло результат.";
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Отменяет фоновое задание по UUID.
//
// Параметры:
//  ИдентификаторЗадания - Строка - UUID фонового задания.
//
Процедура ОтменитьФоновоеЗадание(Знач ИдентификаторЗадания) Экспорт
	
	Попытка
		UUID = Новый УникальныйИдентификатор(ИдентификаторЗадания);
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(UUID);
		Если ФоновоеЗадание <> Неопределено
			И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
			ФоновоеЗадание.Отменить();
		КонецЕсли;
	Исключение
		// Игнорируем ошибки отмены, но оставляем оператор для синтаксической проверки.
		ЗаписьЖурналаРегистрации("ИИ_Ассистент.ОтменитьФоновоеЗадание", УровеньЖурналаРегистрации.Предупреждение, , , ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	КонецПопытки;
	
КонецПроцедуры

// Выполняет запрос к шлюзу ИИ-ассистента в фоновом задании.
// Результат запроса помещается во временное хранилище по переданному адресу.
//
// Параметры:
//  АдресШлюза - Строка - адрес шлюза в формате "host:port".
//  Таймаут - Число - таймаут соединения в секундах.
//  Модель - Строка - имя модели.
//  ТекстВопроса - Строка - текст вопроса пользователя.
//  История - Массив - история сообщений.
//  КонтекстОбъектаJSON - Строка - JSON с контекстом объекта.
//  ПромптПодсказка - Строка - дополнительная подсказка.
//  Вложения - Массив - вложения.
//  АдресХранилища - Строка - адрес временного хранилища для помещения результата.
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия, для которой выполняется запрос.
//
// Возвращаемое значение:
//  Структура - результат запроса (также помещается во временное хранилище):
//   * Успешно - Булево - признак успешного выполнения.
//   * Ответ - Строка - текст ответа шлюза.
//   * СообщениеОбОшибке - Строка - описание ошибки.
//
Функция ВыполнитьЗапросКШлюзу(
		Знач АдресШлюза,
		Знач Таймаут,
		Знач ТекстВопроса,
		Знач История,
		Знач КонтекстОбъектаJSON = "",
		Знач ПромптПодсказка = "",
		Знач Вложения = Неопределено,
		Знач АдресХранилища = "",
		Знач Сессия = Неопределено) Экспорт
	
	Результат = Новый Структура("Успешно, Ответ, СообщениеОбОшибке", Ложь, "", "");
	
	Если Не ЗначениеЗаполнено(АдресШлюза) Тогда
		Результат.СообщениеОбОшибке = "Не задан адрес шлюза ИИ-ассистента.";
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
		Возврат Результат;
	КонецЕсли;
	
	Если Таймаут = 0 Тогда
		Таймаут = 30;
	КонецЕсли;
	
	ПараметрыСоединения = РазобратьАдресШлюза(АдресШлюза);
	Если ПараметрыСоединения.Порт = 0 Тогда
		Результат.СообщениеОбОшибке = "Некорректный адрес шлюза: " + АдресШлюза;
		ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
		Возврат Результат;
	КонецЕсли;
	
	ТелоЗапроса = СформироватьТелоЗапроса(
		ТекстВопроса, История, КонтекстОбъектаJSON, ПромптПодсказка, Вложения);
	
	Попытка
		HTTPСоединение = Новый HTTPСоединение(
			ПараметрыСоединения.Хост,
			ПараметрыСоединения.Порт,
			,
			,
			,
			Таймаут,
			ПараметрыСоединения.ЗащищенноеСоединение);
		
		HTTPЗапрос = Новый HTTPЗапрос("/chat/stream");
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
		HTTPЗапрос.УстановитьТелоИзСтроки(ТелоЗапроса);
		
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Если HTTPОтвет.КодСостояния <> 200 Тогда
			Результат.СообщениеОбОшибке = "Ошибка шлюза: код " + HTTPОтвет.КодСостояния;
			ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
			Возврат Результат;
		КонецЕсли;
		
		ТелоОтвета = HTTPОтвет.ПолучитьТелоКакСтроку();
		РезультатЗапуска = РазобратьОтветПотока(ТелоОтвета);
		
		Если Не РезультатЗапуска.Успешно Тогда
			Результат.СообщениеОбОшибке = РезультатЗапуска.СообщениеОбОшибке;
			ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
			Возврат Результат;
		КонецЕсли;
		
		ИдентификаторЗапроса = РезультатЗапуска.ИдентификаторЗапроса;
		
		// Опрашиваем статус до завершения.
		МаксимальноеВремяОжидания = 600; // 10 минут
		ВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
		ИнтервалОпроса = 1; // секунда
		
		Пока Истина Цикл
			
			ВремяПрошло = (ТекущаяУниверсальнаяДатаВМиллисекундах() - ВремяНачала) / 1000;
			Если ВремяПрошло > МаксимальноеВремяОжидания Тогда
				Результат.СообщениеОбОшибке = "Превышено максимальное время ожидания ответа от шлюза.";
				Прервать;
			КонецЕсли;
			
			HTTPЗапросСтатуса = Новый HTTPЗапрос("/chat/status/" + ИдентификаторЗапроса);
			HTTPОтветСтатуса = HTTPСоединение.Получить(HTTPЗапросСтатуса);
			
			Если HTTPОтветСтатуса.КодСостояния <> 200 Тогда
				Результат.СообщениеОбОшибке = "Ошибка получения статуса: код " + HTTPОтветСтатуса.КодСостояния;
				Прервать;
			КонецЕсли;
			
			РезультатСтатуса = РазобратьСтатусЗапроса(
				HTTPОтветСтатуса.ПолучитьТелоКакСтроку());
			
			Если Не РезультатСтатуса.Успешно Тогда
				Результат.СообщениеОбОшибке = РезультатСтатуса.СообщениеОбОшибке;
				Прервать;
			КонецЕсли;
			
			Если РезультатСтатуса.Завершено Тогда
				Результат.Успешно = Истина;
				Результат.Ответ = РезультатСтатуса.Ответ;
				Прервать;
			КонецЕсли;
			
			// Пауза перед следующим опросом статуса.
			ВызватьПаузу(ИнтервалОпроса * 1000);
			
		КонецЦикла;
		
	Исключение
		Результат.СообщениеОбОшибке = "Ошибка при обращении к шлюзу: " + ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке());
	КонецПопытки;
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
	Возврат Результат;
	
КонецФункции

// Возвращает историю сообщений сессии.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//
// Возвращаемое значение:
//  ТаблицаЗначений - история сообщений с колонками Роль, ТекстСообщения, ИдентификаторСообщения, ДатаСообщения.
//
Функция ПолучитьИсториюСессии(Знач Сессия) Экспорт
	
	Возврат РегистрыСведений.ИИ_ИсторияЧатов.ИсторияСессии(Сессия);
	
КонецФункции

// Возвращает историю сообщений сессии в формате для отправки в шлюз.
// Количество сообщений ограничено константой ИИ_МаксимальноеКоличествоСообщенийКонтекста.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//
// Возвращаемое значение:
//  Массив - элементы Структура("role, content").
//
Функция ПолучитьИсториюСессииДляШлюза(Знач Сессия) Экспорт
	
	Результат = Новый Массив;
	История = ПолучитьИсториюСессии(Сессия);
	
	МаксимальноеКоличество = Константы.ИИ_МаксимальноеКоличествоСообщенийКонтекста.Получить();
	Если МаксимальноеКоличество = 0 Тогда
		МаксимальноеКоличество = 20;
	КонецЕсли;
	
	НачальныйИндекс = 0;
	Если История.Количество() > МаксимальноеКоличество Тогда
		НачальныйИндекс = История.Количество() - МаксимальноеКоличество;
	КонецЕсли;
	
	Для Индекс = НачальныйИндекс По История.Количество() - 1 Цикл
		Сообщение = История[Индекс];
		Роль = ?(Сообщение.Роль = Перечисления.ИИ_РолиСообщений.Ассистент, "assistant", "user");
		Результат.Добавить(Новый Структура("role, content", Роль, Сообщение.ТекстСообщения));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Сохраняет сообщение в истории.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//  Роль - ПеречислениеСсылка.ИИ_РолиСообщений - роль сообщения.
//  ТекстСообщения - Строка - текст сообщения.
//  ДатаСообщения - Дата - дата и время сообщения (по умолчанию текущая дата сеанса).
//
Процедура СохранитьСообщение(Знач Сессия, Знач Роль, Знач ТекстСообщения, Знач ДатаСообщения = Неопределено) Экспорт
	
	РегистрыСведений.ИИ_ИсторияЧатов.ДобавитьСообщение(Сессия, Роль, ТекстСообщения, ДатаСообщения);
	
КонецПроцедуры

// Проверяет, есть ли сообщения в сессии.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - сессия чата.
//
// Возвращаемое значение:
//  Булево - Истина, если в сессии есть сообщения.
//
Функция ЕстьСообщенияВСессии(Знач Сессия) Экспорт
	
	Возврат РегистрыСведений.ИИ_ИсторияЧатов.ЕстьСообщенияВСессии(Сессия);
	
КонецФункции

// Удаляет сессию и всю её историю.
//
// Параметры:
//  Сессия - СправочникСсылка.ИИ_СессииЧатов - удаляемая сессия.
//
Процедура УдалитьСессию(Знач Сессия) Экспорт
	
	РегистрыСведений.ИИ_ИсторияЧатов.УдалитьИсториюСессии(Сессия);
	
	СессияОбъект = Сессия.ПолучитьОбъект();
	Если СессияОбъект <> Неопределено Тогда
		СессияОбъект.Удалить();
	КонецЕсли;
	
КонецПроцедуры

// Возвращает список сессий пользователя.
//
// Параметры:
//  Пользователь - Строка - имя пользователя. Если не указано, используется текущий пользователь.
//  Контекстный - Булево, Неопределено - отбирать только контекстные (Истина), только неконтекстные (Ложь) или все (Неопределено).
//  ОбъектКонтекста - ОпределяемыйТип.ИИ_ТипыОбъектовКонтекстныхЗапросов - объект контекста.
//      Если указан, отбираются сессии с таким же объектом.
//
// Возвращаемое значение:
//  ТаблицаЗначений - сессии с колонками Сессия, Наименование, ДатаСоздания.
//
Функция ПолучитьСписокСессий(
		Знач Пользователь = Неопределено,
		Знач Контекстный = Неопределено,
		Знач ОбъектКонтекста = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		Пользователь = ИмяПользователя();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|   ИИ_СессииЧатов.Ссылка КАК Сессия,
		|   ИИ_СессииЧатов.Наименование КАК Наименование,
		|   ИИ_СессииЧатов.Код КАК Код
		|ИЗ
		|   Справочник.ИИ_СессииЧатов КАК ИИ_СессииЧатов
		|ГДЕ
		|   ИИ_СессииЧатов.Пользователь = &Пользователь
		|   И НЕ ИИ_СессииЧатов.ПометкаУдаления
		|   И (&Контекстный = НЕОПРЕДЕЛЕНО
		|       ИЛИ ИИ_СессииЧатов.Контекстный = &Контекстный)
		|   И (&ОбъектКонтекста = НЕОПРЕДЕЛЕНО
		|       ИЛИ ИИ_СессииЧатов.ОбъектКонтекста = &ОбъектКонтекста)
		|
		|УПОРЯДОЧИТЬ ПО
		|   Код УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	Запрос.УстановитьПараметр("Контекстный", Контекстный);
	Запрос.УстановитьПараметр("ОбъектКонтекста", ОбъектКонтекста);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Формирует HTML для отображения истории сообщений.
//
// Параметры:
//  История - ТаблицаЗначений - история сообщений с колонками Роль, ТекстСообщения, ИдентификаторСообщения, ДатаСообщения.
//  ПоказыватьИндикаторЗагрузки - Булево - если Истина, в конец выводится индикатор ожидания.
//  ФразаОжидания - Строка - фраза, выводимая в индикаторе загрузки.
//  ТекстОшибки - Строка - текст ошибки для вывода в конце истории.
//  ТекстДляПовтора - Строка - исходный текст вопроса для кнопки "Повторить".
//
// Возвращаемое значение:
//  Строка - HTML-текст.
//
Функция СформироватьHTMLСообщений(
		Знач История,
		Знач ПоказыватьИндикаторЗагрузки = Ложь,
		Знач ФразаОжидания = "",
		Знач ТекстОшибки = "",
		Знач ТекстДляПовтора = "") Экспорт
	
	Тело = СформироватьТелоHTMLСообщений(История, ПоказыватьИндикаторЗагрузки, ФразаОжидания, ТекстОшибки, ТекстДляПовтора);
	Возврат ОбернутьТелоВHTMLДокумент(Тело);
	
КонецФункции

// Формирует только тело HTML-сообщений (без обёртки <html>/<body>), которое можно
// встраивать в существующий документ или склеивать с другими фрагментами.
//
// Параметры:
//  История - ТаблицаЗначений - история сообщений.
//  ПоказыватьИндикаторЗагрузки - Булево - выводить индикатор ожидания.
//  ФразаОжидания - Строка - фраза для индикатора.
//  ТекстОшибки - Строка - текст ошибки.
//  ТекстДляПовтора - Строка - текст для кнопки "Повторить".
//
// Возвращаемое значение:
//  Строка - HTML-тело.
//
Функция СформироватьТелоHTMLСообщений(
		Знач История,
		Знач ПоказыватьИндикаторЗагрузки = Ложь,
		Знач ФразаОжидания = "",
		Знач ТекстОшибки = "",
		Знач ТекстДляПовтора = "") Экспорт
	
	HTML = "";
	
	Для Каждого Сообщение Из История Цикл
		Текст = ПреобразоватьТекстВHTML(Сообщение.ТекстСообщения);
		ДатаСтрокой = Формат(Сообщение.ДатаСообщения, "ДФ='dd.MM.yyyy HH:mm'");
		
		Если Сообщение.Роль = Перечисления.ИИ_РолиСообщений.Пользователь Тогда
			HTML = HTML + "
			|<div class='message user'>
			|  <div class='message-date'>" + ДатаСтрокой + "</div>
			|  <div class='user-bubble'>" + Текст + "</div>
			|</div>";
		Иначе
			HTML = HTML + "
			|<div class='message assistant'>
			|  <div class='message-date'>" + ДатаСтрокой + "</div>
			|  <div class='assistant-text'>" + Текст + "</div>
			|  " + КнопкиПродолженияHTML(Сообщение.ТекстСообщения) + "
			|  <div class='copy' onclick='copyMessage(this)' title='Скопировать'><svg xmlns='http://www.w3.org/2000/svg' width='14' height='14' viewBox='0 0 24 24' fill='none' stroke='#888' stroke-width='2' stroke-linecap='round' stroke-linejoin='round'><rect x='9' y='9' width='13' height='13' rx='2' ry='2'/><path d='M5 15H4a2 2 0 0 1-2-2V4a2 2 0 0 1 2-2h9a2 2 0 0 1 2 2v1'/></svg></div>
			|</div>";
		КонецЕсли;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ТекстОшибки) Тогда
		ТекстДляПовтораАтрибут = СтрЗаменить(СтрЗаменить(ТекстДляПовтора, Символы.ПС, " "), Символы.ВК, " ");
		HTML = HTML + "
		|<div class='message assistant'>
		|  <div class='assistant-text error-text'>" + ЭкранироватьДляHTML(ТекстОшибки) + "</div>
		|  <div class='retry-actions'>
		|    <button class='retry-btn' data-action='retry' data-text='" + ЭкранироватьДляHTML(ТекстДляПовтораАтрибут) + "'>Повторить</button>
		|  </div>
		|</div>";
	КонецЕсли;
	
	Если ПоказыватьИндикаторЗагрузки Тогда
		ТекстФразыОжидания = ?(ЗначениеЗаполнено(ФразаОжидания), ФразаОжидания, СлучайнаяФразаОжидания());
		HTML = HTML + "
		|<div class='message assistant'>
		|  <div class='assistant-text loading'>" + ТекстФразыОжидания + "</div>
		|</div>";
	КонецЕсли;
	
	Возврат HTML;
	
КонецФункции

// Обертывает тело сообщений в полноценный HTML-документ со стилями и скриптами.
//
// Параметры:
//  Тело - Строка - HTML-тело сообщений.
//
// Возвращаемое значение:
//  Строка - полный HTML-документ.
//
Функция ОбернутьТелоВHTMLДокумент(Знач Тело) Экспорт
	
	Возврат "<!DOCTYPE html>
	|<html>
	|<head>
	|<meta charset='utf-8'>
	|<style>
	|body { font-family: 'Segoe UI', sans-serif; font-size: 14px; margin: 0; padding: 10px; background: #fff; }
	|.message { margin-bottom: 16px; }
	|.user { text-align: right; }
	|.user-bubble { display: inline-block; background: #f0f0f0; padding: 10px 14px; border-radius: 12px; max-width: 70%; text-align: left; }
|.assistant { text-align: left; }
|.assistant-text { display: inline-block; padding: 10px 14px; border: 1px solid #ddd; border-radius: 12px; background: #fafafa; max-width: 80%; }
|.assistant-text.loading { border: none; background: transparent; padding: 8px 0; }
|.message-date { font-size: 11px; color: #888; margin-bottom: 2px; }
	|.user .message-date { text-align: right; padding-right: 4px; }
	|.copy { display: inline-block; cursor: pointer; margin-top: 4px; }
	|.copy svg { vertical-align: middle; opacity: 0.6; }
	|.copy:hover svg { opacity: 1; }
	|.copy.copied { color: #2e7d32; font-weight: bold; font-size: 14px; }
	|.copy.copied svg { opacity: 1; stroke: #2e7d32 !important; }
	|.loading { color: #888; font-style: italic; }
	|.loading::after { content: '...'; animation: dots 1.5s steps(4, end) infinite; }
	|@keyframes dots { 0%, 20% { content: ''; } 40% { content: '.'; } 60% { content: '..'; } 80%, 100% { content: '...'; } }
	|.md-table { border-collapse: collapse; width: 100%; margin: 8px 0; font-size: 13px; }
	|.md-table th, .md-table td { border: 1px solid #ddd; padding: 6px 8px; text-align: left; vertical-align: top; }
	|.md-table th { background: #f5f5f5; font-weight: 600; }
	|.md-table tr:nth-child(even) { background: #fafafa; }
	|.md-table a { color: #0066cc; text-decoration: none; }
	|.md-table a:hover { text-decoration: underline; }
	|a { color: #0066cc; text-decoration: none; }
	|a:hover { text-decoration: underline; }
|.continue-actions { margin-top: 8px; }
|.continue-btn, .stop-btn { padding: 6px 12px; margin-right: 8px; border: none; border-radius: 6px; cursor: pointer; font-size: 13px; }
|.continue-btn { background: #0066cc; color: #fff; }
|.continue-btn:hover { background: #0055aa; }
|.stop-btn { background: #e0e0e0; color: #333; }
|.stop-btn:hover { background: #d0d0d0; }
|.error-text { background: #fff0f0; border-color: #e0b0b0; color: #a00; }
|.retry-actions { margin-top: 8px; }
|.retry-btn { padding: 6px 12px; border: none; border-radius: 6px; cursor: pointer; font-size: 13px; background: #0066cc; color: #fff; }
|.retry-btn:hover { background: #0055aa; }
	|h1, h2, h3 { margin: 12px 0 8px; font-weight: 600; }
	|h1 { font-size: 18px; }
	|h2 { font-size: 16px; }
	|h3 { font-size: 15px; }
	|ul { margin: 8px 0; padding-left: 20px; }
	|li { margin-bottom: 4px; }
	|b, strong { font-weight: 600; }
	|i, em { font-style: italic; }
	|</style>
	|</head>
	|<body>
	|<div id='messages'>" + Тело + "</div>
	|<script>
	|function copyMessage(el) {
	|    var text = '';
	|    var parent = el.parentElement;
	|    if (parent) {
	|        var textDiv = parent.querySelector('.assistant-text');
	|        if (textDiv) text = textDiv.innerText;
	|    }
	|    var copied = false;
	|    if (navigator.clipboard && navigator.clipboard.writeText) {
	|        try {
	|            navigator.clipboard.writeText(text);
	|            copied = true;
	|        } catch (e) {}
	|    } else if (window.clipboardData && window.clipboardData.setData) {
	|        try {
	|            copied = window.clipboardData.setData('Text', text);
	|        } catch (e) {}
	|    } else {
	|        var ta = document.createElement('textarea');
	|        ta.value = text;
	|        ta.style.position = 'fixed';
	|        ta.style.left = '-9999px';
	|        document.body.appendChild(ta);
	|        ta.select();
	|        try {
	|            copied = document.execCommand('copy');
	|        } catch (e) {}
	|        document.body.removeChild(ta);
	|    }
	|    if (!copied) return;
	|    el.dataset.originalSvg = el.innerHTML;
	|    el.classList.add('copied');
	|    el.innerHTML = '&#10003;';
	|    el.title = 'Скопировано';
	|    setTimeout(function() {
	|        el.classList.remove('copied');
	|        el.innerHTML = el.dataset.originalSvg || '';
	|        el.title = 'Скопировать';
	|    }, 1500);
	|}
	|function scrollToBottom() {
	|    var messages = document.getElementById('messages');
	|    if (messages && messages.lastElementChild) {
	|        try {
	|            messages.lastElementChild.scrollIntoView(false);
	|            return;
	|        } catch (e) {}
	|    }
	|    var body = document.body;
	|    if (body) {
	|        body.scrollTop = body.scrollHeight;
	|        window.scrollTo(0, body.scrollHeight);
	|    }
	|    var html = document.documentElement;
	|    if (html) html.scrollTop = html.scrollHeight;
	|}
	|document.addEventListener('DOMContentLoaded', scrollToBottom);
	|window.onload = scrollToBottom;
	|scrollToBottom();
	|setTimeout(scrollToBottom, 100);
	|setTimeout(scrollToBottom, 500);
	|setTimeout(scrollToBottom, 1000);
	|</script>
	|</body>
	|</html>";
	
КонецФункции

// Формирует HTML одного текущего ответа ассистента (только тело, без обёртки).
//
// Параметры:
//  ТекстОтвета - Строка - текст ответа.
//
// Возвращаемое значение:
//  Строка - HTML-тело сообщения.
//
Функция СформироватьHTMLТекущегоОтвета(Знач ТекстОтвета) Экспорт
	
	История = Новый ТаблицаЗначений;
	История.Колонки.Добавить("Роль");
	История.Колонки.Добавить("ТекстСообщения");
	История.Колонки.Добавить("ИдентификаторСообщения");
	История.Колонки.Добавить("ДатаСообщения");
	
	НоваяСтрока = История.Добавить();
	НоваяСтрока.Роль = Перечисления.ИИ_РолиСообщений.Ассистент;
	НоваяСтрока.ТекстСообщения = ТекстОтвета;
	НоваяСтрока.ИдентификаторСообщения = "";
	НоваяСтрока.ДатаСообщения = ТекущаяДатаСеанса();
	
	Возврат СформироватьТелоHTMLСообщений(История);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает HTML-код кнопок продолжения, если текст сообщения содержит
// фразу о достижении лимита анализа.
//
// Параметры:
//  ТекстСообщения - Строка - исходный текст сообщения ассистента.
//
// Возвращаемое значение:
//  Строка - HTML с кнопками или пустая строка.
//
Функция КнопкиПродолженияHTML(Знач ТекстСообщения)
	
	Если СтрНайти(ТекстСообщения, "Я достиг лимита анализа") = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат "
	|<div class='continue-actions'>
	|  <button class='continue-btn' data-action='continue'>Продолжить</button>
	|  <button class='stop-btn' data-action='stop'>Завершить</button>
	|</div>";
	
КонецФункции

// Экранирует спецсимволы HTML для безопасного вывода текста и атрибутов.
//
// Параметры:
//  Текст - Строка - исходный текст.
//
// Возвращаемое значение:
//  Строка - экранированный текст.
//
Функция ЭкранироватьДляHTML(Знач Текст)
	
	Текст = СтрЗаменить(Текст, "&", "&amp;");
	Текст = СтрЗаменить(Текст, "<", "&lt;");
	Текст = СтрЗаменить(Текст, ">", "&gt;");
	Текст = СтрЗаменить(Текст, """", "&quot;");
	Текст = СтрЗаменить(Текст, "'", "&#39;");
	
	Возврат Текст;
	
КонецФункции

Функция СформироватьНаименованиеСессии(Знач ТекстСообщения, Знач ДатаСоздания) Экспорт
	
	ОчищенныйТекст = СокрЛП(ТекстСообщения);
	
	Если СтрДлина(ОчищенныйТекст) < 3 Тогда
		Возврат "Чат от " + Формат(ДатаСоздания, "ДФ='dd.MM.yyyy HH:mm:ss'");
	КонецЕсли;
	
	МаксимальнаяДлина = 50;
	Если СтрДлина(ОчищенныйТекст) > МаксимальнаяДлина Тогда
		ОчищенныйТекст = Лев(ОчищенныйТекст, МаксимальнаяДлина) + "...";
	КонецЕсли;
	
	Возврат ОчищенныйТекст;
	
КонецФункции

Функция СлучайнаяФразаОжидания()
	
	Возврат "Нагружаю видеокарты знаниями людей...";
	
КонецФункции

// Преобразует исходный текст сообщения в HTML: экранирует спецсимволы,
// заменяет переносы строк на <br>, обрабатывает markdown-таблицы, заголовки,
// списки, жирный и курсивный текст.
//
// Параметры:
//  Текст - Строка - исходный текст.
//
// Возвращаемое значение:
//  Строка - HTML-текст.
//
Функция ПреобразоватьТекстВHTML(Знач Текст)
	
	Строки = СтрРазделить(Текст, Символы.ПС, Истина);
	Результат = Новый Массив;
	
	Индекс = 0;
	Пока Индекс < Строки.Количество() Цикл
		Строка = СокрЛП(Строки[Индекс]);
		
		Если ЭтоСтрокаТаблицы(Строка) Тогда
			БлокТаблицы = Новый Массив;
			Пока Индекс < Строки.Количество() Цикл
				ТекущаяСтрока = СокрЛП(Строки[Индекс]);
				Если Не ЭтоСтрокаТаблицы(ТекущаяСтрока) Тогда
					Прервать;
				КонецЕсли;
				БлокТаблицы.Добавить(ТекущаяСтрока);
				Индекс = Индекс + 1;
			КонецЦикла;
			Результат.Добавить(ПреобразоватьБлокТаблицыВHTML(БлокТаблицы));
		ИначеЕсли УровеньЗаголовка(Строка) > 0 Тогда
			Уровень = УровеньЗаголовка(Строка);
			ТекстЗаголовка = СокрЛП(Сред(Строка, Уровень + 2));
			HTMLЗаголовка = "<h" + Уровень + ">" + ОбработатьВстроеннуюРазметку(ОбработатьСсылкиВСтроке(ТекстЗаголовка)) + "</h" + Уровень + ">";
			Результат.Добавить(HTMLЗаголовка);
			Индекс = Индекс + 1;
		ИначеЕсли ЭтоЭлементСписка(Строка) Тогда
			Результат.Добавить("<ul>");
			Пока Индекс < Строки.Количество() Цикл
				ТекущаяСтрока = СокрЛП(Строки[Индекс]);
				Если Не ЭтоЭлементСписка(ТекущаяСтрока) Тогда
					Прервать;
				КонецЕсли;
				ТекстЭлемента = СокрЛП(Сред(ТекущаяСтрока, 3));
				Результат.Добавить("<li>" + ОбработатьВстроеннуюРазметку(ОбработатьСсылкиВСтроке(ТекстЭлемента)) + "</li>");
				Индекс = Индекс + 1;
			КонецЦикла;
			Результат.Добавить("</ul>");
		Иначе
			Результат.Добавить(ОбработатьВстроеннуюРазметку(ОбработатьСсылкиВСтроке(Строки[Индекс])) + "<br>");
			Индекс = Индекс + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрСоединить(Результат, "");
	
КонецФункции

Функция ЭтоСтрокаТаблицы(Знач Строка)
	
	Если СтрДлина(Строка) < 2 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Лев(Строка, 1) = "|" И Прав(Строка, 1) = "|";
	
КонецФункции

// Определяет уровень markdown-заголовка (#, ##, ###).
// Возвращает 0, если строка не является заголовком.
//
// Параметры:
//  Строка - Строка - строка текста.
//
// Возвращаемое значение:
//  Число - уровень заголовка (1-3) или 0.
//
Функция УровеньЗаголовка(Знач Строка)
	
	Если СтрНачинаетсяС(Строка, "### ") Тогда
		Возврат 3;
	ИначеЕсли СтрНачинаетсяС(Строка, "## ") Тогда
		Возврат 2;
	ИначеЕсли СтрНачинаетсяС(Строка, "# ") Тогда
		Возврат 1;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

// Проверяет, что строка является элементом маркированного списка.
//
// Параметры:
//  Строка - Строка - строка текста.
//
// Возвращаемое значение:
//  Булево - Истина, если строка начинается с "- " или "* ".
//
Функция ЭтоЭлементСписка(Знач Строка)
	
	Возврат СтрНачинаетсяС(Строка, "- ") Или СтрНачинаетсяС(Строка, "* ");
	
КонецФункции

// Обрабатывает встроенную markdown-разметку: жирный (** / __) и курсив (* / _).
//
// Параметры:
//  Текст - Строка - исходный текст (спецсимволы уже экранированы).
//
// Возвращаемое значение:
//  Строка - HTML с тегами <b> и <i>.
//
Функция ОбработатьВстроеннуюРазметку(Знач Текст)
	
	Текст = ЗаменитьПарныеСимволы(Текст, "**", "<b>", "</b>");
	Текст = ЗаменитьПарныеСимволы(Текст, "__", "<b>", "</b>");
	Текст = ЗаменитьПарныеСимволы(Текст, "*", "<i>", "</i>");
	Текст = ЗаменитьПарныеСимволы(Текст, "_", "<i>", "</i>");
	
	Возврат Текст;
	
КонецФункции

// Заменяет пары символов-разделителей на открывающий и закрывающий HTML-тег.
// Обрабатывает только непересекающиеся пары слева направо.
//
// Параметры:
//  Текст - Строка - исходный текст.
//  Разделитель - Строка - символы-разделители (например, "**").
//  ОткрывающийТег - Строка - открывающий HTML-тег.
//  ЗакрывающийТег - Строка - закрывающий HTML-тег.
//
// Возвращаемое значение:
//  Строка - результат замены.
//
Функция ЗаменитьПарныеСимволы(Знач Текст, Знач Разделитель, Знач ОткрывающийТег, Знач ЗакрывающийТег)
	
	ДлинаРазделителя = СтрДлина(Разделитель);
	Результат = "";
	Остаток = Текст;
	Открыт = Ложь;
	
	Пока Истина Цикл
		Позиция = СтрНайти(Остаток, Разделитель);
		Если Позиция = 0 Тогда
			Результат = Результат + Остаток;
			Прервать;
		КонецЕсли;
		
		Результат = Результат + Лев(Остаток, Позиция - 1);
		Результат = Результат + ?(Открыт, ЗакрывающийТег, ОткрывающийТег);
		Открыт = Не Открыт;
		
		Остаток = Сред(Остаток, Позиция + ДлинаРазделителя);
	КонецЦикла;
	
	// Если остался незакрытый открывающий тег - убираем его.
	Если Открыт Тогда
		Результат = СтрЗаменить(Результат, ОткрывающийТег, Разделитель);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Проверяет, что строка является разделителем markdown-таблицы.
// Допустимые символы: |, -, :, пробел.
//
// Параметры:
//  Строка - Строка - строка таблицы.
//
// Возвращаемое значение:
//  Булево - Истина, если строка - разделитель.
//
Функция ЭтоСтрокаРазделитель(Знач Строка)
	
	Для Индекс = 1 По СтрДлина(Строка) Цикл
		Символ = Сред(Строка, Индекс, 1);
		Если Символ <> "|" И Символ <> "-" И Символ <> ":" И Символ <> " " Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат СтрНайти(Строка, "-") > 0;
	
КонецФункции

Функция ПреобразоватьБлокТаблицыВHTML(Знач БлокТаблицы)
	
	Если БлокТаблицы.Количество() = 0 Тогда
		Возврат "";
	КонецЕсли;
	
	ЕстьЗаголовок = Ложь;
	НачальныйИндексДанных = 0;
	
	Если БлокТаблицы.Количество() >= 2 Тогда
		ВтораяСтрока = БлокТаблицы[1];
		Если ЭтоСтрокаРазделитель(ВтораяСтрока) Тогда
			ЕстьЗаголовок = Истина;
			НачальныйИндексДанных = 2;
		КонецЕсли;
	КонецЕсли;
	
	HTML = "<table class='md-table'>";
	
	Если ЕстьЗаголовок Тогда
		HTML = HTML + "<thead><tr>";
		ЯчейкиЗаголовка = РазобратьСтрокуТаблицы(БлокТаблицы[0]);
		Для Каждого Ячейка Из ЯчейкиЗаголовка Цикл
			HTML = HTML + "<th>" + Ячейка + "</th>";
		КонецЦикла;
		HTML = HTML + "</tr></thead>";
	КонецЕсли;
	
	HTML = HTML + "<tbody>";
	
	Для Индекс = НачальныйИндексДанных По БлокТаблицы.Количество() - 1 Цикл
		HTML = HTML + "<tr>";
		Ячейки = РазобратьСтрокуТаблицы(БлокТаблицы[Индекс]);
		Для Каждого Ячейка Из Ячейки Цикл
			HTML = HTML + "<td>" + Ячейка + "</td>";
		КонецЦикла;
		HTML = HTML + "</tr>";
	КонецЦикла;
	
	HTML = HTML + "</tbody></table>";
	
	Возврат HTML;
	
КонецФункции

Функция РазобратьСтрокуТаблицы(Знач Строка)
	
	Ячейки = Новый Массив;
	Части = СтрРазделить(Строка, "|", Истина);
	
	// Первый и последний элементы пустые из-за ведущего и замыкающего разделителя.
	Для Индекс = 1 По Части.Количество() - 2 Цикл
		Ячейки.Добавить(ОбработатьСсылкиВСтроке(СокрЛП(Части[Индекс])));
	КонецЦикла;
	
	Возврат Ячейки;
	
КонецФункции

// Ищет в строке HTTP/HTTPS-ссылки и оборачивает их в HTML-ссылки.
// Остальной текст экранируется.
//
// Параметры:
//  Текст - Строка - исходная строка.
//
// Возвращаемое значение:
//  Строка - HTML с активными ссылками.
//
Функция ОбработатьСсылкиВСтроке(Знач Текст)
	
	Результат = "";
	Остаток = Текст;
	
	Пока Истина Цикл
		
		ПозицияHTTP = СтрНайти(Остаток, "http://");
		ПозицияHTTPS = СтрНайти(Остаток, "https://");
		
		Если ПозицияHTTP = 0 И ПозицияHTTPS = 0 Тогда
			Результат = Результат + ЭкранироватьHTML(Остаток);
			Прервать;
		КонецЕсли;
		
		Если ПозицияHTTP = 0 Или (ПозицияHTTPS > 0 И ПозицияHTTPS < ПозицияHTTP) Тогда
			Позиция = ПозицияHTTPS;
		Иначе
			Позиция = ПозицияHTTP;
		КонецЕсли;
		
		Результат = Результат + ЭкранироватьHTML(Лев(Остаток, Позиция - 1));
		
		Хвост = Сред(Остаток, Позиция);
		URL = ИзвлечьURL(Хвост);
		
		Если ЗначениеЗаполнено(URL) Тогда
			Результат = Результат + "<a href='" + ЭкранироватьHTML(URL) + "' target='_blank'>" + ЭкранироватьHTML(URL) + "</a>";
			Остаток = Сред(Хвост, СтрДлина(URL) + 1);
		Иначе
			// Не удалось выделить URL - выводим как есть и выходим, чтобы избежать зацикливания.
			Результат = Результат + ЭкранироватьHTML(Хвост);
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// Выделяет URL из начала строки, ограничивая его пробельными символами
// и символами, которые не могут входить в URL.
//
// Параметры:
//  Текст - Строка - строка, начинающаяся с http:// или https://.
//
// Возвращаемое значение:
//  Строка - выделенный URL.
//
Функция ИзвлечьURL(Знач Текст)
	
	СимволыОкончания = " " + Символы.Таб + Символы.ПС + Символы.ВК + "<>""')]}";
	
	Для Индекс = 1 По СтрДлина(Текст) Цикл
		Символ = Сред(Текст, Индекс, 1);
		Если СтрНайти(СимволыОкончания, Символ) > 0 Тогда
			Возврат Лев(Текст, Индекс - 1);
		КонецЕсли;
	КонецЦикла;
	
	Возврат Текст;
	
КонецФункции

Функция ЭкранироватьHTML(Знач Текст)
	
	Текст = СтрЗаменить(Текст, "&", "&amp;");
	Текст = СтрЗаменить(Текст, "<", "&lt;");
	Текст = СтрЗаменить(Текст, ">", "&gt;");
	Текст = СтрЗаменить(Текст, """", "&quot;");
	Текст = СтрЗаменить(Текст, "'", "&#x27;");
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#Область HTTPСервер

// Разбирает адрес шлюза вида "host:port", "http://host:port" или "https://host:port".
//
// Параметры:
//  АдресШлюза - Строка - адрес шлюза.
//
// Возвращаемое значение:
//  Структура - Хост, Порт, ЗащищенноеСоединение.
//
Функция РазобратьАдресШлюза(Знач АдресШлюза)
	
	Результат = Новый Структура("Хост, Порт, ЗащищенноеСоединение", АдресШлюза, 0, Неопределено);
	
	// Убираем схему http:// или https://
	Если СтрНачинаетсяС(НРег(АдресШлюза), "https://") Тогда
		Результат.ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
		АдресШлюза = Сред(АдресШлюза, 9);
	ИначеЕсли СтрНачинаетсяС(НРег(АдресШлюза), "http://") Тогда
		АдресШлюза = Сред(АдресШлюза, 8);
	Иначе
		// Нет схемы - используем адрес как есть.
	КонецЕсли;
	
	// Убираем trailing path
	ПозицияСлеша = СтрНайти(АдресШлюза, "/");
	Если ПозицияСлеша > 0 Тогда
		АдресШлюза = Лев(АдресШлюза, ПозицияСлеша - 1);
	КонецЕсли;
	
	// Хост:порт
	ПозицияДвоеточия = СтрНайти(АдресШлюза, ":");
	Если ПозицияДвоеточия > 0 Тогда
		Результат.Хост = Лев(АдресШлюза, ПозицияДвоеточия - 1);
		ПортСтрока = Сред(АдресШлюза, ПозицияДвоеточия + 1);
		Попытка
			Результат.Порт = Число(ПортСтрока);
		Исключение
			Результат.Порт = 0;
		КонецПопытки;
	Иначе
		Результат.Хост = АдресШлюза;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Формирует тело JSON-запроса к шлюзу ИИ-ассистента.
//
// Параметры:
//  ТекстВопроса - Строка - текст вопроса пользователя.
//  История - Массив - история сообщений.
//  КонтекстОбъектаJSON - Строка - JSON с контекстом объекта.
//  Модель - Строка - имя модели.
//  ПромптПодсказка - Строка - дополнительная подсказка.
//  Вложения - Массив - вложения.
//
// Возвращаемое значение:
//  Строка - JSON-текст.
//
Функция СформироватьТелоЗапроса(Знач ТекстВопроса, Знач История, Знач КонтекстОбъектаJSON, Знач ПромптПодсказка = "", Знач Вложения = Неопределено)
	
	Запрос = Новый Структура;
	Запрос.Вставить("question", ТекстВопроса);
	Запрос.Вставить("messages", История);
	Запрос.Вставить("context_object", КонтекстОбъектаJSON);
	Запрос.Вставить("prompt_hint", ПромптПодсказка);
	
	Если Вложения <> Неопределено И Вложения.Количество() > 0 Тогда
		МассивВложений = Новый Массив;
		Для Каждого Вложение Из Вложения Цикл
			ОписаниеВложения = Новый Структура;
			ОписаниеВложения.Вставить("file_name", Вложение.ИмяФайла);
			ОписаниеВложения.Вставить("mime_type", Вложение.MimeType);
			ОписаниеВложения.Вставить("data", Вложение.ДанныеBase64);
			МассивВложений.Добавить(ОписаниеВложения);
		КонецЦикла;
		Запрос.Вставить("attachments", МассивВложений);
	КонецЕсли;
	
	Возврат ЗаписатьЗначениеJSON(Запрос);
	
КонецФункции

// Разбирает ответ шлюза на запуск потоковой генерации.
//
// Параметры:
//  ТелоОтвета - Строка - тело ответа.
//
// Возвращаемое значение:
//  Структура - Успешно, ИдентификаторЗапроса, СообщениеОбОшибке.
//
Функция РазобратьОтветПотока(Знач ТелоОтвета)
	
	Результат = Новый Структура("Успешно, ИдентификаторЗапроса, СообщениеОбОшибке", Ложь, "", "");
	
	Попытка
		Данные = ПрочитатьЗначениеJSON(ТелоОтвета);
		
		Успешно = Ложь;
		Статус = "";
		Если (Данные.Свойство("success", Успешно) И Успешно)
			Или (Данные.Свойство("status", Статус) И Статус = "ok") Тогда
			Результат.Успешно = Истина;
			Данные.Свойство("request_id", Результат.ИдентификаторЗапроса);
		Иначе
			Сообщение = "";
			Если Данные.Свойство("error", Сообщение) Тогда
				Результат.СообщениеОбОшибке = Сообщение;
			ИначеЕсли Данные.Свойство("status", Статус) И Статус = "error" Тогда
				Результат.СообщениеОбОшибке = "Ошибка шлюза.";
			Иначе
				Результат.СообщениеОбОшибке = "Некорректный ответ шлюза.";
			КонецЕсли;
		КонецЕсли;
	Исключение
		Результат.СообщениеОбОшибке = "Ошибка разбора ответа шлюза: " + ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

// Разбирает ответ шлюза на запрос статуса потоковой генерации.
//
// Параметры:
//  ТелоОтвета - Строка - тело ответа.
//
// Возвращаемое значение:
//  Структура - Успешно, Завершено, Ответ, Версия, СообщениеОбОшибке.
//
Функция РазобратьСтатусЗапроса(Знач ТелоОтвета)
	
	Результат = Новый Структура("Успешно, Завершено, Ответ, Версия", Ложь, Ложь, "", 0);
	Результат.Вставить("СообщениеОбОшибке", "");
	
	Попытка
		Данные = ПрочитатьЗначениеJSON(ТелоОтвета);
		
		Успешно = Ложь;
		Статус = "";
		Если (Данные.Свойство("success", Успешно) И Успешно)
			Или (Данные.Свойство("status", Статус) И Статус = "ok") Тогда
			Результат.Успешно = Истина;
			Данные.Свойство("done", Результат.Завершено);
			Данные.Свойство("answer", Результат.Ответ);
			Данные.Свойство("version", Результат.Версия);
		Иначе
			Сообщение = "";
			Если Данные.Свойство("error", Сообщение) Тогда
				Результат.СообщениеОбОшибке = Сообщение;
			ИначеЕсли Данные.Свойство("status", Статус) И Статус = "error" Тогда
				Результат.СообщениеОбОшибке = "Ошибка шлюза.";
			Иначе
				Результат.СообщениеОбОшибке = "Некорректный ответ шлюза.";
			КонецЕсли;
		КонецЕсли;
	Исключение
		Результат.СообщениеОбОшибке = "Ошибка разбора ответа шлюза: " + ОбработкаОшибок.ПредставлениеОшибкиДляПользователя(ИнформацияОбОшибке());
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
